{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye"
      ],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Thank's a lot!"
      ],
      "responses": [
        "Happy to help!",
        "Any time!",
        "My pleasure"
      ]
    },
    {
      "tag": "taj_mahal",
      "patterns": [
        "Tell me about the Taj Mahal",
        "What is the Taj Mahal?",
        "What is the history of the Taj Mahal?"
      ],
      "responses": [
        "The Taj Mahal is an ivory-white marble mausoleum on the right bank of the Yamuna river in the Indian city of Agra. It was commissioned in 1632 by the Mughal emperor, Shah Jahan, to house the tomb of his favorite wife, Mumtaz Mahal. It also houses the tomb of Shah Jahan, the builder."
      ]
    },
    {
      "tag": "red_fort",
      "patterns": [
        "Tell me about the Red Fort",
        "What is the Red Fort?",
        "What is the history of the Red Fort?"
      ],
      "responses": [
        "The Red Fort is a historic fort in the city of Delhi in India. It was the main residence of the emperors of the Mughal dynasty for nearly 200 years, until 1856. It is located in the center of Delhi and houses a number of museums."
      ]
    },
    {
      "tag": "humayun_tomb",
      "patterns": [
        "Tell me about the Humayun's Tomb",
        "What is the Humayun's Tomb?",
        "What is the history of the Humayun's Tomb?"
      ],
      "responses": [
        "Humayun's tomb is the tomb of the Mughal Emperor Humayun in Delhi, India. The tomb was commissioned by Humayun's first wife and chief consort, Empress Bega Begum, in 1569-70, and designed by Mirak Mirza Ghiyas and his son, Sayyid Muhammad, Persian architects chosen by her."
      ]
    },
    {
      "tag": "jama_masjid",
      "patterns": [
        "Tell me about the Jama Masjid",
        "What is the Jama Masjid?",
        "What is the history of the Jama Masjid?"
      ],
      "responses": [
        "The Masjid-i Jahān-Numā, commonly known as the Jama Masjid of Delhi, is one of the largest mosques in India. It was built by Mughal Emperor Shah Jahan between 1644 and 1656 at a cost of 1 million rupees, and was inaugurated by an Imam from Bukhara, present-day Uzbekistan."
      ]
    },
    {
      "tag": "raj_ghat",
      "patterns": [
        "Tell me about the Raj Ghat",
        "What is the Raj Ghat?",
        "What is the history of the Raj Ghat?"
      ],
      "responses": [
        "Raj Ghat is a memorial dedicated to Mahatma Gandhi in Delhi, India. Originally it was the name of a historic ghat of Old Delhi. Close to it, and east of Daryaganj was Raj Ghat Gate of the walled city, opening at Raj Ghat on Yamuna River."
      ]
    },
    {
      "tag": "jantar_mantar",
      "patterns": [
        "Tell me about the Jantar Mantar",
        "What is the Jantar Mantar?",
        "What is the history of the Jantar Mantar?"
      ],
      "responses": [
        "The Jantar Mantar is an equinoctial sundial, consisting of a gigantic triangular gnomon with the hypotenuse parallel to the Earth's axis. On either side of the gnomon is a quadrant of a circle, parallel to the plane of the equator. The instrument is intended to measure the time of day, correct to half a second and declination of the Sun and the other heavenly bodies."
      ]
    },
    {
      "tag": "purana_qila",
      "patterns": [
        "Tell me about the Purana Qila",
        "What is the Purana Qila?",
        "What is the history of the Purana Qila?"
      ],
      "responses": [
        "Purana Qila is one of the oldest forts in Delhi. Its current form was built by Sher Shah Suri, the founder of the Sur Empire. Sher Shah raised the citadel of Purana-Qal'a with an extensive city-area sprawling around it. It seems that the Purana-Qal'a was still incomplete at Sher Shah's death in 1545, and was perhaps completed by his son Islam Shah or Humayun, although it is not certain which parts were built by whom."
      ]
    },
    {
      "tag": "qutub_minar",
      "patterns": [
        "Tell me about the Qutub Minar",
        "What is the Qutub Minar?",
        "What is the history of the Qutub Minar?"
      ],
      "responses": [
        "The Qutub Minar is a minaret that forms part of the Qutb complex, a UNESCO World Heritage Site in the Mehrauli area of Delhi, India. Made of red sandstone and marble, Qutub Minar is a 73-metre (240 feet) tall tapering tower of five storeys, with a 14.3 metres (47 feet) base diameter, reducing to 2.7 metres (9 feet) at the top of the peak."
      ]
    },
    {
      "tag": "india_gate",
      "patterns": [
        "Tell me about the India Gate",
        "What is the India Gate?",
        "What is the history of the India Gate?"
      ],
      "responses": [
        "The India Gate is a war memorial located astride the Rajpath, on the eastern edge of the 'ceremonial axis' of New Delhi, India, formerly called Kingsway. It stands as a memorial to 70,000 soldiers of the British Indian Army who died in between 1914 to 1921 in the First World War, in France, Flanders, Mesopotamia, Persia, East Africa, Gallipoli and elsewhere in the Near and the Far East, and the Third Anglo-Afghan War."
      ]
    },
    {
      "tag": "lotus_temple",
      "patterns": [
        "Tell me about the Lotus Temple",
        "What is the Lotus Temple?",
        "What is the history of the Lotus Temple?"
      ],
      "responses": [
        "The Lotus Temple, located in Delhi, India, is a Bahá'í House of Worship that was dedicated in December 1986. Notable for its flowerlike shape, it has become a prominent attraction in the city. Like all Bahá'í Houses of Worship, the Lotus Temple is open to all, regardless of religion or any other qualification."
      ]
    },
    {
      "tag": "akshardham",
      "patterns": [
        "Tell me about the Akshardham",
        "What is the Akshardham?",
        "What is the history of the Akshardham?"
      ],
      "responses": [
        "Akshardham is a spiritual-cultural campus in New Delhi, India. Also referred to as Delhi Akshardham or Swaminarayan Akshardham, the complex displays millennia of traditional Hindu and Indian culture, spirituality, and architecture. The building was inspired and moderated by Pramukh Swami Maharaj, the spiritual head of the Bochasanwasi Shri Akshar Purushottam Swaminarayan Sanstha, whose 3,000 volunteers helped 7,000 artisans construct Akshardham."
      ]
    },
    {
      "tag": "temperature",
      "patterns": [
        "What is the temperature in {location}?",
        "temperature in {location}?"
      ]
    },
    {
      "tag":"weather",
      "patterns": [
        "What is the weather in {location}?",
        "weather in {location}?"
      ]
    }
  ]
}