{
    "intents": [
        {
            "tag": "taj_mahal_info",
            "patterns": [
                "Tell me about the Taj Mahal",
                "What do you know about the Taj Mahal?",
                "Give me information on the Taj Mahal",
                "Details of the Taj Mahal"
            ],
            "responses": [
                "Certainly! The Taj Mahal is a white marble mausoleum in Agra, India. It was built by the Mughal emperor Shah Jahan in memory of his wife Mumtaz Mahal. The Taj Mahal is a UNESCO World Heritage site and a symbol of eternal love.",
                "The Taj Mahal is an iconic masterpiece of Mughal architecture, located on the banks of the Yamuna River. It is one of the Seven Wonders of the World and a symbol of India's rich cultural heritage.",
                "Nestled in Agra, the Taj Mahal is a breathtaking monument known for its stunning white marble and intricate design. It stands as a testament to the timeless love story of Shah Jahan and Mumtaz Mahal."
            ]
        },
        {
            "tag": "qutub_minar_info",
            "patterns": [
                "Tell me about the Qutub Minar",
                "What do you know about the Qutub Minar?",
                "Give me information on the Qutub Minar",
                "Details of the Qutub Minar"
            ],
            "responses": [
                "Certainly! The Qutub Minar is a UNESCO World Heritage site in Delhi, India. It is a tall minaret built in the early 13th century, standing as a symbol of the Delhi Sultanate's architectural brilliance.",
                "The Qutub Minar is an impressive tower built with red sandstone and marble. It is the tallest brick minaret in the world and is surrounded by ancient ruins, including the Iron Pillar of Delhi.",
                "Located in Delhi, the Qutub Minar is a historical marvel dating back to the 12th century. Its intricate carvings and towering structure make it a prominent landmark in India's capital city."
            ]
        },
        {
            "tag": "amber_fort_info",
            "patterns": [
                "Tell me about the Amber Fort",
                "What do you know about the Amber Fort?",
                "Give me information on the Amber Fort",
                "Details of the Amber Fort"
            ],
            "responses": [
                "Certainly! The Amber Fort is a majestic fort located in Jaipur, Rajasthan. It is known for its artistic architecture, stunning views, and historical significance as the residence of the Rajput rulers.",
                "The Amber Fort, also known as Amer Fort, is a UNESCO World Heritage site. It showcases a beautiful blend of Hindu and Rajput architectural styles, featuring palaces, courtyards, and intricate decorations.",
                "Situated on a hilltop in Jaipur, the Amber Fort is a captivating fortress with ornate palaces and grand gateways. Its unique blend of Rajput and Mughal architecture makes it a must-visit destination in Rajasthan."
            ]
        },
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hello",
                "Hey",
                "How are you",
                "Good morning",
                "Good evening"
            ],
            "responses": [
                "Hello!",
                "Good to see you again!",
                "Hi there, how can I help?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye",
                "Nice chatting to you, bye",
                "Till next time"
            ],
            "responses": [
                "See you!",
                "Have a nice day",
                "Bye! Come back again soon."
            ]
        },
        {
            "tag": "capabilites",
            "patterns": [
                "What can you do?",
                "What are your capabilities?",
                "What are you capable of?"
            ],
            "responses": [
                "I can help you with providing details of historical places."
            ]
        },
        {
            "tag": "weather",
            "patterns": [
                "What is the weather like in {location}?",
                "Tell me the weather forecast for {location}",
                "Is it going to rain in {location} today?",
                "Weather update for {location}"
            ],
            "responses": [
                "The weather in {location} is sunny today.",
                "It seems like a cloudy day in {location}.",
                "Expect some rain in {location} later.",
                "I'm sorry, I couldn't fetch the weather information for {location} at the moment."
            ]
        },
        {
            "tag" :"temperature",
            "patterns": [
                "What is the temperature in {location}?",
                "Tell me the temperature for {location}",
                "Is it hot in {location} today?",
                "Temperature update for {location}"
            ]
        }
    ]
}